import { z } from "zod";

const RegisterSchema = z.object({
  name: z
    .string({ message: "نام خود را وارد کنید" })
    .min(1, "نام خود را وارد کنید"),
  email: z
    .string({ message: "ایمیل خود را وارد کنید" })
    .email("فرمت ایمیل نادرست است"),
  phone: z
    .string({ message: "شماره تلفن خود را وارد کنید" })
    .min(11, { message: "شماره تلفن حداقل باید 11 کاراکتر باشد" })
    .max(11, { message: "شماره تلفن حداکثر باید 11 کاراکتر باشد" })
    .regex(/^(\+98|0)?9\d{9}$/g, "فرمت شماره نادرست است"),
  password: z
    .string({ message: "رمز خود را وارد کنید" })
    .min(8, { message: "رمز عبور باید 8 کاراکتر یا بیشتر باشد" })
    .regex(
      /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$ %^&*-]).{8,}$/g,
      "رمز عبور باید ترکیبی از حروف کوچک و بزرگ و اعداد و کاراکتر خاص باشد"
    ),
  confirmPassword: z
    .string({ message: "تکرار رمز خود را وارد کنید" })
    .min(8, { message: "رمز عبور باید 8 کاراکتر یا بیشتر باشد" })
    .regex(
      /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$ %^&*-]).{8,}$/g,
      "رمز عبور باید ترکیبی از حروف کوچک و بزرگ و اعداد و کاراکتر خاص باشد"
    ),
});

export default RegisterSchema;
